from .splitglyph import akshara_to_glyphs

symbols = [
    ' ', 'ॐ',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
    '౦', '౧', '౨', '౩', '౪', '౫', '౬', '౭', '౮', '౯',
    '!', '"', '%', '&', "'", '(', ')', '+', ',', '-', '.', '/',
    ':', ';', '<', '=', '>', '?', '{', '}',
    'ఁ', 'ం', 'ః',
    'అ', 'ఆ', 'ఇ', 'ఈ', 'ఉ', 'ఊ', 'ఋ', 'ౠ', 'ఌ', 'ౡ', 'ఎ', 'ఏ', 'ఐ', 'ఒ', 'ఓ', 'ఔ',
    '✓', 'ా', 'ి', 'ీ', 'ు', 'ూ', 'ృ', 'ౄ', 'ౢ', 'ౣ', 'ె', 'ే', 'ై', 'ొ', 'ో', 'ౌ', '్',
    'క', 'ఖ', 'గ', 'ఘ', 'ఙ',
    'చ', 'ఛ', 'జ', 'ఝ', 'ఞ',
    'ట', 'ఠ', 'డ', 'ఢ', 'ణ',
    'త', 'థ', 'ద', 'ధ', 'న',
    'ప', 'ఫ', 'బ', 'భ', 'మ',
    'య', 'ర', 'ఱ', 'ల', 'ళ', 'వ',
    'శ', 'ష', 'స', 'హ',
    '్క', '్ఖ', '్గ', '్ఘ', '్ఙ',
    '్చ', '్ఛ', '్జ', '్ఝ', '్ఞ',
    '్ట', '్ఠ', '్డ', '్ఢ', '్ణ',
    '్త', '్థ', '్ద', '్ధ', '్న',
    '్ప', '్ఫ', '్బ', '్భ', '్మ',
    '్య', '్ర', '్ఱ', '్ల', '్ళ', '్వ',
    '్శ', '్ష', '్స', '్హ',
    'ౘ', 'ౙ',
    'ఽ', '౾',
    '।', '॥',
]


def get_labels(list_of_aksharas):
    ret = []

    for akshara in list_of_aksharas:
        parts = akshara_to_glyphs(akshara)

        for part in parts:
            if 'క' <= part[0] <= 'హ':
                ret.append(symbols.index(part[0]))

                if len(part) == 1:
                    ret.append(symbols.index('✓'))
                elif len(part) == 2:
                    ret.append(symbols.index(part[1]))
                else:
                    raise ValueError(akshara, part)

            else:
                ret.append(symbols.index(part))

    return ret