symbols = [
    ' ', 'ॐ',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
    '౦', '౧', '౨', '౩', '౪', '౫', '౬', '౭', '౮', '౯',
    '!', '"', '%', '&', "'", '(', ')', '+', ',', '-', '.', '/',
    ':', ';', '<', '=', '>', '?', '{', '}',
    'ఁ', 'ం', 'ః',
    'అ', 'ఆ', 'ఇ', 'ఈ', 'ఉ', 'ఊ', 'ఋ', 'ౠ', 'ఌ', 'ౡ', 'ఎ', 'ఏ', 'ఐ', 'ఒ', 'ఓ', 'ఔ',
    'ృ', 'ౄ', 'ౢ', 'ౣ',
    'క', 'కా', 'కి', 'కీ', 'కు', 'కూ', 'కె', 'కే', 'కై', 'కొ', 'కో', 'కౌ', 'క్',
    'ఖ', 'ఖా', 'ఖి', 'ఖీ', 'ఖు', 'ఖూ', 'ఖె', 'ఖే', 'ఖై', 'ఖొ', 'ఖో', 'ఖౌ', 'ఖ్',
    'గ', 'గా', 'గి', 'గీ', 'గు', 'గూ', 'గె', 'గే', 'గై', 'గొ', 'గో', 'గౌ', 'గ్',
    'ఘ', 'ఘా', 'ఘి', 'ఘీ', 'ఘు', 'ఘూ', 'ఘె', 'ఘే', 'ఘై', 'ఘొ', 'ఘో', 'ఘౌ', 'ఘ్',
    'ఙ', 'ఙా', 'ఙి', 'ఙీ', 'ఙు', 'ఙూ', 'ఙె', 'ఙే', 'ఙై', 'ఙొ', 'ఙో', 'ఙౌ', 'ఙ్',
    'చ', 'చా', 'చి', 'చీ', 'చు', 'చూ', 'చె', 'చే', 'చై', 'చొ', 'చో', 'చౌ', 'చ్',
    'ఛ', 'ఛా', 'ఛి', 'ఛీ', 'ఛు', 'ఛూ', 'ఛె', 'ఛే', 'ఛై', 'ఛొ', 'ఛో', 'ఛౌ', 'ఛ్',
    'జ', 'జా', 'జి', 'జీ', 'జు', 'జూ', 'జె', 'జే', 'జై', 'జొ', 'జో', 'జౌ', 'జ్',
    'ఝ', 'ఝా', 'ఝి', 'ఝీ', 'ఝు', 'ఝూ', 'ఝె', 'ఝే', 'ఝై', 'ఝొ', 'ఝో', 'ఝౌ', 'ఝ్',
    'ఞ', 'ఞా', 'ఞి', 'ఞీ', 'ఞు', 'ఞూ', 'ఞె', 'ఞే', 'ఞై', 'ఞొ', 'ఞో', 'ఞౌ', 'ఞ్',
    'ట', 'టా', 'టి', 'టీ', 'టు', 'టూ', 'టె', 'టే', 'టై', 'టొ', 'టో', 'టౌ', 'ట్',
    'ఠ', 'ఠా', 'ఠి', 'ఠీ', 'ఠు', 'ఠూ', 'ఠె', 'ఠే', 'ఠై', 'ఠొ', 'ఠో', 'ఠౌ', 'ఠ్',
    'డ', 'డా', 'డి', 'డీ', 'డు', 'డూ', 'డె', 'డే', 'డై', 'డొ', 'డో', 'డౌ', 'డ్',
    'ఢ', 'ఢా', 'ఢి', 'ఢీ', 'ఢు', 'ఢూ', 'ఢె', 'ఢే', 'ఢై', 'ఢొ', 'ఢో', 'ఢౌ', 'ఢ్',
    'ణ', 'ణా', 'ణి', 'ణీ', 'ణు', 'ణూ', 'ణె', 'ణే', 'ణై', 'ణొ', 'ణో', 'ణౌ', 'ణ్',
    'త', 'తా', 'తి', 'తీ', 'తు', 'తూ', 'తె', 'తే', 'తై', 'తొ', 'తో', 'తౌ', 'త్',
    'థ', 'థా', 'థి', 'థీ', 'థు', 'థూ', 'థె', 'థే', 'థై', 'థొ', 'థో', 'థౌ', 'థ్',
    'ద', 'దా', 'ది', 'దీ', 'దు', 'దూ', 'దె', 'దే', 'దై', 'దొ', 'దో', 'దౌ', 'ద్',
    'ధ', 'ధా', 'ధి', 'ధీ', 'ధు', 'ధూ', 'ధె', 'ధే', 'ధై', 'ధొ', 'ధో', 'ధౌ', 'ధ్',
    'న', 'నా', 'ని', 'నీ', 'ను', 'నూ', 'నె', 'నే', 'నై', 'నొ', 'నో', 'నౌ', 'న్',
    'ప', 'పా', 'పి', 'పీ', 'పు', 'పూ', 'పె', 'పే', 'పై', 'పొ', 'పో', 'పౌ', 'ప్',
    'ఫ', 'ఫా', 'ఫి', 'ఫీ', 'ఫు', 'ఫూ', 'ఫె', 'ఫే', 'ఫై', 'ఫొ', 'ఫో', 'ఫౌ', 'ఫ్',
    'బ', 'బా', 'బి', 'బీ', 'బు', 'బూ', 'బె', 'బే', 'బై', 'బొ', 'బో', 'బౌ', 'బ్',
    'భ', 'భా', 'భి', 'భీ', 'భు', 'భూ', 'భె', 'భే', 'భై', 'భొ', 'భో', 'భౌ', 'భ్',
    'మ', 'మా', 'మి', 'మీ', 'ము', 'మూ', 'మె', 'మే', 'మై', 'మొ', 'మో', 'మౌ', 'మ్',
    'య', 'యా', 'యి', 'యీ', 'యు', 'యూ', 'యె', 'యే', 'యై', 'యొ', 'యో', 'యౌ', 'య్',
    'ర', 'రా', 'రి', 'రీ', 'రు', 'రూ', 'రె', 'రే', 'రై', 'రొ', 'రో', 'రౌ', 'ర్',
    'ఱ', 'ఱా', 'ఱి', 'ఱీ', 'ఱు', 'ఱూ', 'ఱె', 'ఱే', 'ఱై', 'ఱొ', 'ఱో', 'ఱౌ', 'ఱ్',
    'ల', 'లా', 'లి', 'లీ', 'లు', 'లూ', 'లె', 'లే', 'లై', 'లొ', 'లో', 'లౌ', 'ల్',
    'ళ', 'ళా', 'ళి', 'ళీ', 'ళు', 'ళూ', 'ళె', 'ళే', 'ళై', 'ళొ', 'ళో', 'ళౌ', 'ళ్',
    'వ', 'వా', 'వి', 'వీ', 'వు', 'వూ', 'వె', 'వే', 'వై', 'వొ', 'వో', 'వౌ', 'వ్',
    'శ', 'శా', 'శి', 'శీ', 'శు', 'శూ', 'శె', 'శే', 'శై', 'శొ', 'శో', 'శౌ', 'శ్',
    'ష', 'షా', 'షి', 'షీ', 'షు', 'షూ', 'షె', 'షే', 'షై', 'షొ', 'షో', 'షౌ', 'ష్',
    'స', 'సా', 'సి', 'సీ', 'సు', 'సూ', 'సె', 'సే', 'సై', 'సొ', 'సో', 'సౌ', 'స్',
    'హ', 'హా', 'హి', 'హీ', 'హు', 'హూ', 'హె', 'హే', 'హై', 'హొ', 'హో', 'హౌ', 'హ్',
    '్క', '్ఖ', '్గ', '్ఘ', '్ఙ',
    '్చ', '్ఛ', '్జ', '్ఝ', '్ఞ',
    '్ట', '్ఠ', '్డ', '్ఢ', '్ణ',
    '్త', '్థ', '్ద', '్ధ', '్న',
    '్ప', '్ఫ', '్బ', '్భ', '్మ',
    '్య', '్ర', '్ఱ', '్ల', '్ళ', '్వ',
    '్శ', '్ష', '్స', '్హ',
    'ౘ', 'ౙ',
    'ఽ', '౾',
    '।', '॥',
]

###############################################################################
from .splitglyph import akshara_to_glyphs


def get_labels(list_of_aksharas):
    ret = []

    for akshara in list_of_aksharas:
        parts = akshara_to_glyphs(akshara)

        for part in parts:
            ret.append(symbols.index(part))

    return ret

def get_labels_(list_of_aksharas):
    return [symbols.index(part)
            for akshara in list_of_aksharas
            for part in akshara_to_glyphs(akshara)]